''' 
Завдання 2

Реалізувати двійковий пошук для відсортованого масиву з дробовими числами. 
Написана функція для двійкового пошуку повинна повертати кортеж, 
де першим елементом є кількість ітерацій, потрібних для знаходження елемента. 
Другим елементом має бути "верхня межа" — це найменший елемент, який є більшим або рівним заданому значенню.
'''

def binary_search(arr, x):
    low = 0
    high = len(arr) - 1
    mid = 0
    count = 0
 
    while low <= high:
        count += 1
        mid = (high + low) // 2
 
        # якщо x більше за значення посередині списку, ігноруємо ліву половину
        if arr[mid] < x:
            low = mid + 1
 
        # якщо x менше за значення посередині списку, ігноруємо праву половину
        elif arr[mid] > x:
            high = mid - 1
 
        # інакше x присутній на позиції і повертаємо його
        else:
            return count, arr[mid] if high - mid != 1 else arr[high]
 
    # якщо елемент не знайдений
    return count, arr[low] if x < arr[-1] else -1


l = [1.1, 5.3, 7.2, 10.23, 11.8, 25/2, 15.4, 90, 100]
to_find = float(input('Enter a number: '))
print(to_find)
print(binary_search(l, to_find))
